Even after fixing the module and all related variables the node_instance_type is the same. Is even not the default one from variables from the module (m5.large is defined but it's creating m4.large). From what I see this variable is used only for self-managed nodes.
Output from terraform plan:
```
 # module.eks-jx.module.cluster.module.eks.module.node_groups.aws_eks_node_group.workers["eks-jx-node-group"] will be created
  + resource "aws_eks_node_group" "workers" {
      + ami_type        = "AL2_x86_64"
      + arn             = (known after apply)
      + capacity_type   = (known after apply)
      + cluster_name    = "cp-dev"
      + disk_size       = 10
      + id              = (known after apply)
      + instance_types  = [
          + "m4.large",
        ]
```